app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `articles`
---



        $data['totalArticles'] = $ArticleModel->countAllResults();