app/Models/SeoModel.php

SELECT `articles`.`title`, `articles`.`slug`, `articles`.`article_id`, `seo_metadata`.`page_type`, `seo_metadata`.`meta_title`, `seo_metadata`.`meta_description`, `seo_metadata`.`meta_keywords`, `seo_metadata`.`og_title`, `seo_metadata`.`og_description`, `seo_metadata`.`twitter_title`, `seo_metadata`.`twitter_description`, `seo_metadata`.`robots_meta`
FROM `articles`
JOIN `seo_metadata` ON `articles`.`article_id` = `seo_metadata`.`page_id`
WHERE `articles`.`slug` = ''
---
    public function getSeoMeta($slug)
    {
        // Using the built-in DB connection from Model
        $builder = $this->db->table($this->table);

        $builder->select([
            'articles.title',
            'articles.slug',
            'articles.article_id',
            'seo_metadata.page_type',
            'seo_metadata.meta_title',
            'seo_metadata.meta_description',
            'seo_metadata.meta_keywords',
            'seo_metadata.og_title',
            'seo_metadata.og_description',
            'seo_metadata.twitter_title',
            'seo_metadata.twitter_description',
            'seo_metadata.robots_meta'
        ]);

        $builder->join(
            $this->seoTable,
            'articles.article_id = seo_metadata.page_id'
        );